testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
#include <string>
#include <exception>
#include <cassert>

#include <Alo.h>
#include <LlirException.h>

#include "M480Instructions.h"
#include <OctaveUpdateOpndVisitor.h>
#include "M480UpdateOpndVisitor.h"

#include <iostream>

#ifdef GCCBUILD
#include <insn-constants.h>
#endif

using namespace Llir;
extern std::map<string, shared_ptr<const PrototypeDirective> > g_prototypeDirList;

namespace Alo
{

  M480UpdateOpndVisitor::M480UpdateOpndVisitor(OctaveAlo &i, 	
					       shared_ptr<AltEntryFunction> fn)
    : OctaveUpdateOpndVisitor(i),
      m_currentFn(fn)
  {}

  M480UpdateOpndVisitor::M480UpdateOpndVisitor(const M480UpdateOpndVisitor& rhs)
    : OctaveUpdateOpndVisitor(rhs)
  {}

  const M480UpdateOpndVisitor&
  M480UpdateOpndVisitor::operator=(const M480UpdateOpndVisitor& rhs)
  {
    if(this == &rhs)
      {
	return *this;
      }

    OctaveUpdateOpndVisitor::operator=(rhs);

    return *this;
  }

  shared_ptr<AltEntryFunction> 
  M480UpdateOpndVisitor::getCurrentFn() const
  {
    return m_currentFn;
  }

  void M480UpdateOpndVisitor::visit(const InvalidOctaveInstruction& v){}

  void 
  M480UpdateOpndVisitor::visit(const M480AddwhInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
    
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddwlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddwwInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubwhInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubwlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubwwInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SublInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddwhiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddwliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddwwiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480AddliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480SubwhiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480SubwliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

