testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
  }

  void M480UpdateOpndVisitor::visit(const M480SubwwiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480SubliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480FfsInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480FlsInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ParInstruction &i)  
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }
    
  void M480UpdateOpndVisitor::visit(const M480Add4xInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddcInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
    i.addUsedRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480AndInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480MaxInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480MinInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480OrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubInstruction &i)
   {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

 void M480UpdateOpndVisitor::visit(const M480SubbInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addUsedRegister(getHardRegister(REG_ESS));
    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480XorInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddciInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
    i.addUsedRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SubbiInstruction &i)
   {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
    i.addUsedRegister(getHardRegister(REG_ESS));
        

