testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
  }

  void M480UpdateOpndVisitor::visit(const M480RandInstruction &i)
  {
    
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480RotlInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480RotrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ClrbInstruction &i)  
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480SetbInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ShftInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ShftaInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
        
    i.addSetRegister(getHardRegister(REG_ESS));

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ShlInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ShrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ShraInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480RandiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480RotliInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480RotriInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480SetbiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480ClrbiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

