testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
  }

  void M480UpdateOpndVisitor::visit(const M480ShliInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480ShriInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480ShraiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480MaxiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480MiniInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480AndiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480OriInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480XoriInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480MulInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
  }

  void M480UpdateOpndVisitor::visit(const M480MulhInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
  }

  void M480UpdateOpndVisitor::visit(const M480MuliInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
  }

  void M480UpdateOpndVisitor::visit(const M480MulhiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
  }

  void M480UpdateOpndVisitor::visit(const M480AddneInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480AddneiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ByteswInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480BcdrInstruction &i)
  {
    shared_ptr<const Register> rsb = i.getSrc1();
    shared_ptr<const LlirOperand> rpc = i.getDst();

    i.addUsedRegister(rsb);
    
    if(i.isCallInsn())
      {
	
	i.addSetRegister(rpc);
      }
  }

  void M480UpdateOpndVisitor::visit(const M480BcrInstruction &i)
  {
    shared_ptr<const Register> rsb = i.getSrc1();
    shared_ptr<const LlirOperand> rpc = i.getDst();

    i.addUsedRegister(rsb);
    
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BcdiInstruction &i)
  {
    shared_ptr<const LlirOperand> rpc = i.getDst();

    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BciInstruction &i)
  {
    shared_ptr<const LlirOperand> rpc = i.getDst();

    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BnzrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const Register> rsb = i.getSrc2();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
	
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BzrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const Register> rsb = i.getSrc2();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
	
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BnziInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
    i.addUsedRegister(rsa);
	
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BziInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
    i.addUsedRegister(rsa);
	
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480RnmiInstruction &i)
  {
    //use REG_88
    i.addUsedRegister(getHardRegister(REG_88));
  }

  void M480UpdateOpndVisitor::visit(const M480RintInstruction &i)
  {
    //use REG_87
    i.addUsedRegister(getHardRegister(REG_87));
  }

  void M480UpdateOpndVisitor::visit(const M480BrsInstruction &i)
  {
    //use REG_69
    i.addUsedRegister(getHardRegister(REG_69));
  }

  void M480UpdateOpndVisitor::visit(const M480BrslInstruction &i)
  {
    //clobber/set REG26:REG59
    i.addSetRegister(getHardRegister(REG_26, REG_59));
  }

  void M480UpdateOpndVisitor::visit(const M480BrspreInstruction &i)
  {}

  void M480UpdateOpndVisitor::visit(const M480CmpInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480CmpiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);

    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480CmprInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
    i.addSetRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480CmpriInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
    i.addSetRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480BiInstruction &i)
  {
    shared_ptr<const LlirOperand> rpc = i.getDst();
    	
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480BrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rpc = i.getDst();
    	
    i.addUsedRegister(rsa);
    if(i.isCallInsn())
      {
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480DepbInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

