testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
  void M480UpdateOpndVisitor::visit(const M480DepbiInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(rd);
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480ExtbInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480CmovInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    shared_ptr<const Register> rd = i.getDst();

    i.addUsedRegister(getHardRegister(REG_ESS));    

    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
    i.addSetRegister(rd);
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480CmoviInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addUsedRegister(getHardRegister(REG_ESS));    

    i.addUsedRegister(rsa);
    i.addSetRegister(rd);
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480DmapInstruction &i)
  {
    shared_ptr<const MultiRegister> rsa = i.getRegs();
    i.addUsedRegister(rsa);
    i.addUsedRegister(getHardRegister(REG_107));
    i.addUsedRegister(getHardRegister(REG_108));
    i.addUsedRegister(getHardRegister(REG_109));
  }

  void M480UpdateOpndVisitor::visit(const M480DmasrInstruction &i)
  {
    shared_ptr<const MultiRegister> rsa = i.getRegs();
    i.addUsedRegister(rsa);
    i.addUsedRegister(getHardRegister(REG_107));
    i.addUsedRegister(getHardRegister(REG_108));
    i.addUsedRegister(getHardRegister(REG_109));
  }

  void M480UpdateOpndVisitor::visit(const M480Dmau0Instruction &i)
  {
    shared_ptr<const MultiRegister> rsa = i.getRegs();
    i.addUsedRegister(rsa);
    i.addUsedRegister(getHardRegister(REG_107));
    i.addUsedRegister(getHardRegister(REG_108));
    i.addUsedRegister(getHardRegister(REG_109));
  }

  void M480UpdateOpndVisitor::visit(const M480Dmau1Instruction &i)
  {
    shared_ptr<const MultiRegister> rsa = i.getRegs();
    i.addUsedRegister(rsa);
    i.addUsedRegister(getHardRegister(REG_107));
    i.addUsedRegister(getHardRegister(REG_108));
    i.addUsedRegister(getHardRegister(REG_109));
  }

  void M480UpdateOpndVisitor::visit(const M480LihInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480LilInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480LwihInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }


  void M480UpdateOpndVisitor::visit(const M480LwilInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480LaihInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);
    i.addUsedRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480LailInstruction &i)
  {
    shared_ptr<const Register> rd = i.getDst();
    i.addSetRegister(rd);
    i.addUsedRegister(rd);

    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480NopInstruction &i)
  {}

  void M480UpdateOpndVisitor::visit(const M480Hec5Instruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addUsedRegister(rsb);
    i.addSetRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480MvInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addSetRegister(rd);
    i.addUsedRegister(rsa);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480MvrhInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
    
    //if rd is REG_80, set REG_ESS_BMEHWEPD
    //if rd is REG_80, set REG_ESS_BMEEXHAUST
    if(rd->getRegNum() == REG_80)
      {
	i.addSetRegister(getHardRegister(REG_ESS_BMEHWEPD));
	i.addSetRegister(getHardRegister(REG_ESS_BMEEXHAUST));
      }
    //if rd is REG_94, set REG_ESS_BMESWEPD
    else if(rd->getRegNum() == REG_94)
      {
	i.addSetRegister(getHardRegister(REG_ESS_BMESWEPD));
      }
    //update this method as per m480.md mvrh patterns
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480MvhrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc();
    shared_ptr<const Register> rd = i.getDst();
    
    i.addSetRegister(rd);
    i.addUsedRegister(rsa);
            
    setLinkRegisterUsage(i, rd);
  }

  void M480UpdateOpndVisitor::visit(const M480UnlinkInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();

    i.addUsedRegister(mRegs);

    unsigned int count = mRegs->getNumRegs();
    
    unsigned int rd1 = mRegs->getFirstRegNum();
    unsigned int rdN = rd1 + count - 1;
    
    unsigned int reg;
    for(reg = rd1; reg <= rdN; reg++)
      {
	setRegLink(reg, LinkFlag::NOLINK);
      }
  }

  void M480UpdateOpndVisitor::visit(const M480LinkInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_ANY, lnk, mRegs);

    i.addUsedRegister(mRegs);

    
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinksInstruction &i)
  {

