testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinkspInstruction &i)
  {
    
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType(); 
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinksplInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
 

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM_LOCKED, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinksrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SRAM, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinksdInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SDRAM, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinkccInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
 
    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinkcclInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
 

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM_LOCKED, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LinksioInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    shared_ptr<const OctaveMemory> mem = i.getMem();
 

    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SIO, lnk, mRegs);

    i.addUsedRegister(mRegs);
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_ANY, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmspInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    

    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmsplInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
