testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM_LOCKED, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM_LOCK));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmsrInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmsdInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();
    
    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SDRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SDRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmccInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_CCRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmcclInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM_LOCKED, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_CCRAM_LOCK));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmsiInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SIO, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SIO));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LmmsInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480LspInstruction &i)
  {
    unsigned int excLine = i.getSrcLineNum();
    const char* excFile = i.getSrcFile().c_str();

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
    
    shared_ptr<const OctaveMemory> mem = i.getMem();

    LinkFlag::Link_Flag_t lnk;

    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    else
      {
	lnk = LinkFlag::CLEARLINK;
      }
    
    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addSetRegister(mRegs);

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
    i.addSetRegister(getLinkRegister(lnk));
  }

  void M480UpdateOpndVisitor::visit(const M480SmmInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

