testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
    shared_ptr<const OctaveMemory> mem = i.getMem();

    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmspInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmsplInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM_LOCK));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmsrInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmsdInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SDRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmccInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_CCRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmcclInstruction &i)
  {

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_CCRAM_LOCK));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmsiInstruction &i)
  {

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SIO));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SmmsInstruction &i)
  {
    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480SspInstruction &i)
  {

    shared_ptr<const MultiRegister> mRegs = i.getRegs();
    i.addUsedRegister(mRegs);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    i.addUsedRegister(getHardRegister(REG_BASE_SPRAM));
    setMemRefRegisterUsage(i, mem);
  }

  void M480UpdateOpndVisitor::visit(const M480TsetbInstruction &i)
  {   
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);
    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480TclrbInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);    
    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480GetInstruction &i)
  {
    i.addUsedRegister(i.getRsa());
    //use REG_110
    i.addUsedRegister(getHardRegister(REG_110));   
  }

  void M480UpdateOpndVisitor::visit(const M480PutcInstruction &i)
  {
    i.addUsedRegister(i.getRsa());
    i.addUsedRegister(i.getRsb());
    //use REG_110
    i.addUsedRegister(getHardRegister(REG_110));   
  }

  void M480UpdateOpndVisitor::visit(const M480PutmInstruction &i)
  {
    i.addUsedRegister(i.getRsa());
    i.addUsedRegister(i.getRsb());
    //use REG_110
    i.addUsedRegister(getHardRegister(REG_110));   
  }

  void M480UpdateOpndVisitor::visit(const M480PutpInstruction &i)
  {
    i.addUsedRegister(i.getRsa());
    i.addUsedRegister(i.getRsb());
  }
  

  void M480UpdateOpndVisitor::visit(const M480PutdInstruction &i)
  {
    i.addUsedRegister(i.getRsa());
    i.addUsedRegister(i.getRsb());
  }

  void M480UpdateOpndVisitor::visit(const M480JtablebrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);
  }

  void M480UpdateOpndVisitor::visit(const M480JtableRelativebrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);
  }

  void M480UpdateOpndVisitor::visit(const M480JHec5Instruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rd);
    i.addUsedRegister(rsb);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddwhInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddwhiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

