testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
  }

  void M480UpdateOpndVisitor::visit(const M480JaddwlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddwliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }


  void M480UpdateOpndVisitor::visit(const M480JaddwwInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JaddwwiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsublInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwhInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwhiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwlInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwliInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwwInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JsubwwiInstruction &i)
  {
    shared_ptr<const LlirOperand> rsb = i.getSrc1();
    shared_ptr<const Register> rd = i.getDst();

    i.addSetRegister(rsb);
    i.addUsedRegister(rsb);
    i.addUsedRegister(rd);

    i.addSetRegister(getHardRegister(REG_ESS));
        
    setLinkRegisterUsage(i, rd);

  }

  void M480UpdateOpndVisitor::visit(const M480JbcdiInstruction &i)
  {
    i.addUsedRegister(getHardRegister(REG_ESS));

    if(i.isCallInsn())
      {
	shared_ptr<const OpndLabel> l = shared_dynamic_cast<const OpndLabel>(i.getSrc1());

	const char* name; 

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getDst();
    
	i.addSetRegister(rpc);
      }    
  }


  void M480UpdateOpndVisitor::visit(const M480JbcdrInstruction &i)
  {
    i.addUsedRegister(getHardRegister(REG_ESS));

    shared_ptr<const Register> rsb = i.getSrc1();
    i.addUsedRegister(rsb);
    
    if(i.isCallInsn())
      {
	shared_ptr<const IndirectCallTargetList> targetList =
	  shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	shared_ptr<const OpndLabel> l;

	if(targetList)
	  l = shared_dynamic_cast<const OpndLabel>(targetList->getLabelList()->getLabel(0));

	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
