testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	i.addSetRegister(rpc);
      }
  }

  void M480UpdateOpndVisitor::visit(const M480JbciInstruction &i)
  {
    i.addUsedRegister(getHardRegister(REG_ESS));

    if(i.isCallInsn())
      {
	shared_ptr<const OpndLabel> l = shared_dynamic_cast<const OpndLabel>(i.getSrc1());

	const char* name;

	if(l)
	   name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getDst();
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480JbcrInstruction &i)
  {
    i.addUsedRegister(getHardRegister(REG_ESS));

    shared_ptr<const Register> rsb = i.getSrc1();
    i.addUsedRegister(rsb);
    
    if(i.isCallInsn())
      {
	shared_ptr<const IndirectCallTargetList> targetList =
	  shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	shared_ptr<const OpndLabel> l;

	if(targetList)
	  l = shared_dynamic_cast<const OpndLabel>(targetList->getLabelList()->getLabel(0));

	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getDst();
	i.addSetRegister(rpc);
      }    
  }


  void M480UpdateOpndVisitor::visit(const M480JrnmiInstruction &i)
  {
    //use REG_88
    i.addUsedRegister(getHardRegister(REG_88));   
  }

  void M480UpdateOpndVisitor::visit(const M480JrintInstruction &i)
  {
    //use REG_87    
    i.addUsedRegister(getHardRegister(REG_87));   
  }

  void M480UpdateOpndVisitor::visit(const M480JbiInstruction &i)  
  {
    if(i.isCallInsn())
      {
	shared_ptr<const OpndLabel> l = shared_dynamic_cast<const OpndLabel>(i.getSrc1());
	    
	const char* name;

	if(l)
	  name = l->getName().c_str();


	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getDst();

	i.addSetRegister(rpc);
      }
  }    

  void M480UpdateOpndVisitor::visit(const M480JbnzrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    i.addUsedRegister(rsa);

    shared_ptr<const Register> rsb = i.getSrc2();
    i.addUsedRegister(rsb);
	
    if(i.isCallInsn())
      {
	//mark call result regs as set
	shared_ptr<const IndirectCallTargetList> targetList =
	  shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	shared_ptr<const OpndLabel> l;

	if(targetList)
	  l = shared_dynamic_cast<const OpndLabel>(targetList->getLabelList()->getLabel(0));

	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();

	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480JbnziInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    i.addUsedRegister(rsa);
	
    if(i.isCallInsn())
      {
	//mark call result regs as set
	shared_ptr<const OpndLabel> l = shared_dynamic_cast<const OpndLabel>(i.getSrc2());

