testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }


	//mark call return reg as set
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480JbrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    i.addUsedRegister(rsa);
	
    if(i.isCallInsn())
      {
	//mark call result regs as set
	shared_ptr<const IndirectCallTargetList> targetList =
	  shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	shared_ptr<const OpndLabel> l;

	if(targetList)
	  l = shared_dynamic_cast<const OpndLabel>(targetList->getLabelList()->getLabel(0));

	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark RPC return reg as set
	shared_ptr<const LlirOperand> rpc = i.getDst();
    
	i.addUsedRegister(rsa);    
      }
  }

  void M480UpdateOpndVisitor::visit(const M480JbrsInstruction &i)
  {
    //use REG_69
    i.addUsedRegister(getHardRegister(REG_69));   
  }

  void M480UpdateOpndVisitor::visit(const M480JbrslInstruction &i)
  {
    //clobber/set REG26:REG59
    i.addSetRegister(getHardRegister(REG_26, REG_59));   
  }

  void M480UpdateOpndVisitor::visit(const M480JbzrInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    i.addUsedRegister(rsa);

    shared_ptr<const Register> rsb = i.getSrc2();
    i.addUsedRegister(rsb);
	
    if(i.isCallInsn())
      {
	//mark call result regs as set
	shared_ptr<const IndirectCallTargetList> targetList =
	  shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	shared_ptr<const OpndLabel> l;

	if(targetList)
	  l = shared_dynamic_cast<const OpndLabel>(targetList->getLabelList()->getLabel(0));
	
	const char* name;

	if(l)
	  name = l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg as set
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
	
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480JbziInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    i.addUsedRegister(rsa);
	
    if(i.isCallInsn())
      {
	//mark call result regs as set
	shared_ptr<const OpndLabel> l = shared_dynamic_cast<const OpndLabel>(i.getSrc2());

	const char* name;

	if(l)
	  name =  l->getName().c_str();

	shared_ptr<const PrototypeDirective> proto = searchForPrototype(i.getLineNum(), 
									i.getSrcFile().c_str(),
									name);
	
	RegList::ConstIterator iter;

	//mark call input arg regs as used
	shared_ptr<const RegList> argList = proto->getArgList()->getRegList();

	iter = argList->begin();
	
	for(; iter != argList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addUsedRegister(reg);
	  }

	//mark call result regs as set
	shared_ptr<const RegList> resultList = proto->getResultList()->getRegList();

	iter = resultList->begin();
	
	for(; iter != resultList->end(); iter++)
	  {
	    shared_ptr<const Register> reg = iter->second;
	    i.addSetRegister(reg);
	  }

	//mark call return reg RPC as set
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
    
	i.addSetRegister(rpc);
      }    
  }

  void M480UpdateOpndVisitor::visit(const M480JcmpInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    shared_ptr<const LlirOperand> rsb = i.getSrc2();
    
    i.addUsedRegister(rsa);
    i.addUsedRegister(rsb);
    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480JcmpiInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);
    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480JtsetbInstruction &i)
  {
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);    
    i.addSetRegister(getHardRegister(REG_ESS));
  }

  void M480UpdateOpndVisitor::visit(const M480JtclrbInstruction &i)
  {   
    shared_ptr<const Register> rsa = i.getSrc1();
    
    i.addUsedRegister(rsa);
    i.addSetRegister(getHardRegister(REG_ESS));
  }


  void 
  M480UpdateOpndVisitor::setLinkRegisterUsage(const OctaveInstruction &i,
					      shared_ptr<const Register> rd)
  {
    LinkFlag::Link_Flag_t lnk = getRegLink(rd->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd->getRegNum());
	
    if(lnk != LinkFlag::NOLINK)
      {
	i.addUsedRegister(getLinkRegister(lnk));
	i.addUsedRegister(getLinkedMemTypeRegister(mem));
      }
  }

  void 
  M480UpdateOpndVisitor::setMemRefRegisterUsage(const OctaveInstruction &i,
						shared_ptr<const OctaveMemory> mem)
  {
    
