testhound/alo/alo/octave/m480/M480UpdateOpndVisitor.cpp
    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);

    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);

    shared_ptr<const ImpliedBase2Offset> impOffset = 
      shared_dynamic_cast<const ImpliedBase2Offset>(mem);

    if(regOffset)
      {
	// 0(rsa)
	// imm(rsa)

	shared_ptr<const Register> rsa = regOffset->getBaseRegister();
	i.addUsedRegister(rsa);

      }
    else if(base2Offset || impOffset)
      {
	// BASE2 label_expr

	i.addUsedRegister(getHardRegister(REG_BASE2));

      }
    else if(base3Offset)
      {
	// BASE3 label_expr

	i.addUsedRegister(getHardRegister(REG_BASE3));
      }

  }
					      
  shared_ptr<const Register>
  M480UpdateOpndVisitor::getHardRegister(unsigned int regNo)
  {
    shared_ptr<OctaveFactory> m480f = getAlo().getFactory();
    
    return m480f->createHardReg(regNo);
  }
					      
  shared_ptr<const Register>
  M480UpdateOpndVisitor::getHardRegister(unsigned int lsw, unsigned int msw)
  {
    shared_ptr<OctaveFactory> m480f = getAlo().getFactory();
    
    return m480f->createMultiHardReg(msw-lsw+1, lsw);
  }

  shared_ptr<const Register>
  M480UpdateOpndVisitor::getLinkRegister(LinkFlag::Link_Flag_t lnk)
  {
    shared_ptr<OctaveFactory> m480f = getAlo().getFactory();

    switch(lnk)
      {
      case LinkFlag::LNK1:
	return getHardRegister(REG_LNK1);

      case LinkFlag::LNK2:
	return getHardRegister(REG_LNK2);

      case LinkFlag::LNK3:
	return getHardRegister(REG_LNK3);

      default:
	return m480f->createNullReg();
      }
  }

  shared_ptr<const Register>
  M480UpdateOpndVisitor::getLinkedMemTypeRegister(OctaveMemory::MemType_t mem)
  {
    shared_ptr<OctaveFactory> m480f = getAlo().getFactory();

    switch(mem)
      {
      case OctaveMemory::MEMTYPE_SRAM:
	return getHardRegister(REG_BASE_SPRAM);

      case OctaveMemory::MEMTYPE_SDRAM:
	return getHardRegister(REG_BASE_SDRAM);

      case OctaveMemory::MEMTYPE_SIO:
	return getHardRegister(REG_BASE_SIO);

      case OctaveMemory::MEMTYPE_SPRAM:
	return getHardRegister(REG_BASE_SPRAM);

      case OctaveMemory::MEMTYPE_SPRAM_LOCKED:
	return getHardRegister(REG_BASE_SPRAM_LOCK);

      case OctaveMemory::MEMTYPE_CCRAM:
	return getHardRegister(REG_BASE_CCRAM);

      case OctaveMemory::MEMTYPE_CCRAM_LOCKED:
	return getHardRegister(REG_BASE_CCRAM_LOCK);

      default:
	return m480f->createNullReg();
      }
  }



  //book keeping function which
  //tracks which register is linked 
  //to what memory and through which
  //link register (LNK1,LNK2,LNK3)

  void 
  M480UpdateOpndVisitor::updateLinkInfo(unsigned int excLine,
					const char* excFile,
					OctaveMemory::MemType_t  mem,
					LinkFlag::Link_Flag_t lnk,
					shared_ptr<const MultiRegister> mRegs)
  {
    unsigned int rd1 = mRegs->getFirstRegNum();
    unsigned int rdN = rd1 + mRegs->getNumRegs() - 1;


    if(rdN > 63)
      {
	//Note: links can only be set between hard registers and memory

	//generating rtl for lmm/smm instruction containing
	//pseudo registers... make sure that lnk flag is 
	//not specified in such instructions

	if(lnk == LinkFlag::LNK1 || 
	   lnk == LinkFlag::LNK2 ||
	   lnk == LinkFlag::LNK3)
	  {
	    OctaveAlo& alo = getAlo();
	    char *excStr = new char[128];
	    shared_ptr<std::exception> exc; 
	    
	    sprintf(excStr, "Cannot associate memory links to pseudo registers");
	    exc = shared_ptr<IllegalInsn> 
	      (new IllegalInsn(excStr, excLine, excFile, __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      }

    if(lnk != LinkFlag::NOLINK)
      {
	if(lnk == LinkFlag::CLEARLINK)
	  {
	    for(unsigned int reg = rd1; reg <= rdN; reg++)
	      {
		setRegLink(reg, LinkFlag::NOLINK);
		setRegisterLinkedMemoryType(reg, OctaveMemory::MEMTYPE_ANY);
	      }
	  }
	else 
	  {
	    //set links...
	    for(unsigned int reg = rd1; reg <= rdN; reg++)
	      {
		setRegLink(reg, lnk);
		setRegisterLinkedMemoryType(reg, mem);
	      }
	  }
      }
  }


  shared_ptr<const PrototypeDirective>
  M480UpdateOpndVisitor::searchForPrototype(unsigned int line,
					    const char* file,
					    const char* name)
  {
    std::map<string, shared_ptr<const PrototypeDirective> >::const_iterator iter;

    iter = g_prototypeDirList.find(name);

    if(iter != g_prototypeDirList.end())
      {
        return iter->second;
      }
    else
      {
        shared_ptr<std::exception> exc;

        char *excStr = new char[128];

        sprintf(excStr, "%s:%d: Valid prototype not found for Call label : %s", file, line, name);

        throw LLIR_INTERNAL_EXCEPTION(excStr);

        delete excStr;
      }
  }


}
